
 [
    {
      "deptHeading": "About the Computer Engineering Department",
      "mainImg": "../assets/Images/bird.jpg",
      "secondaryImg": "../assets/Images/hod-cs 1.png",
      "url": "/department/computer-engineering",
      "deptContent":
        "Computer Engineering combines the academic disciplines of electronics engineering and computer sciences which helps our engineering graduates to combine their understanding of computer hardware and software to innovate the stream. Computer engineering programmes prepare graduates for highly valued, sky-high careers in design, development, research and testing of various hardware and software. The department focuses not only on the theoretical aspects but emphasize the overall development of the students. It conducts various co-curricular activities such as informative workshops and industrial visits to companies. It makes the student industry ready with all practical exposer, expert talks on new technologies, technical events like coding competition, hackathon, etc. We believe, such activities help them to meet the demands of Industry or existing market.",
      "vision": [
        {
          "point1":
            "Evolve as a center of excellence with wider recognition and to adapt the rapid innovation in Computer Engineering.",
          "point2": "this is point 2",
          "point3": "this is point 3"
        }
      ],
     "mission": [
        {
          "point1":
            " To provide a learning-centered environment that will enable students and faculty members to achieve their goals empowering them to compete globally for the most desirable careers in academia and industry.",
         "point2": "Hey there this is point 2",
         "point3": "Hey there this is point 3"
        }
      ],
      "deptImage1": "../assets/Images/hod-cs 1.png",
      "deptImage2": "../assets/Images/hod-cs 1.png",
      "deptImage3": "../assets/Images/hod-cs 1.png",
      "deptImage4": "../assets/Images/hod-cs 1.png",
      "deptImage5": "../assets/Images/hod-cs 1.png",

      "hodName": "Dr. Nikita Jain",
      "hodDept": "HOD Computer Engineering",
      "hodMsg":
        "A hearty welcome to the Department of Computer Engineering at Poornima college of Engineering, Jaipur. We are dedicated to providing not only the technical education to our students but also the leadership skills through which they can produce employment to others. The department offers graduate program B. Tech in Computer Engineering and B. Tech in CSE (Regional language), enriched in core learning, challenges and opportunities. The department’s major force is a team of well-qualified and dedicated faculty members that permanently support students for their academic excellence and instil a spirit of Team-Work in them. It is our major responsibility to keep our students committed not only to technical education but also to their self-reflection and critical thinking and to meet the expectations of the industries.<br></br> <br></br> The teaching module comprises lectures, tutorials and practical. The methodology adopted in the classroom learning is based on application of innovative techniques, regular coursework and relations between teachers and students. <br></br> <br></br>Our department is also emphasis to identify the course outcomes for their subjects and perform mapping with POs, PEOs and PSOs and needs to fulfil the identified curricular gaps for the attainment of POs and PSOs by delivering lectures beyond the syllabus, arranging expert lectures, value added courses, industrial training, internship etc.<br></br> <br></br> Our placement records have always been very impressive, with the large number of students being placed year after year in highly reputed core companies and public sector units. Our alumni hold senior positions in industries as well as in academic institutions, both in India and abroad. The research work forms the department is contributing strongly across several disciplines that include Machine Learning, Big Data, Software Engineering and IOT. <br></br> <br></br>The department have RTU recognized Centre of Excellence in Artificial Intelligence and Big Data. The Department exhilarate students to get registered in variety of courses offered by online portals such as NPTEL, Swayam, Microsoft, Coursera, etc.",

      "department": "Department of Computer Engineering",
      "program": "B.tech. (Computer Engineering)",
      "Intake2020": 500,
      "Intake2021": 500,
      "Intake2022": 500
    }

]

